Courses/4420/Lectures/Fortification/AccessControl/login-security.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Login Security</title>
<!-- 2014-07-11 Fri 10:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="WSU CEG 4900/6900 Android Internals and Security"
 />
</head>
<body>
<div id="preamble" class="status">
2014-07-11 <a href="../../Top/"> CEG 4900</a>
</div>
<div id="content">
<h1 class="title">Login Security</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Lectures</a></li>
<li><a href="#sec-2">2. Android UID setup</a></li>
<li><a href="#sec-3">3. References</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Lectures</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>User Authentication Approaches

<ol class="org-ol">
<li>What You Know
</li>
<li>What You Have
</li>
<li>What You Are
</li>
</ol>
</li>

<li>Passwords on a Linux System
</li>

<li>Cracking the Passwords
</li>

<li>Prevention of Password Cracking
</li>

<li>Two Factor Authentication
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Android UID setup</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Android does <b>not</b> have /etc/passwd,
/etc/shadow, and /etc/group files.  The file named
<a href="https://android.googlesource.com/platform/system/core.git/+/master/include/private/android_filesystem_config.h">android-filesystem-config.h</a> in the AOSP source tree has the
equivalent code.
</li>

<li>E.g.,
<ol class="org-ol">
<li><code>#define AID_ROOT 0 /* traditional unix root user */</code>
</li>
<li><code>#define AID_GPS 1021 /* GPS daemon */</code>
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Prabhaker Mateti, <a href="../../../4420/Password/index.html">Password Cracking</a>, 2013. Skip the Lab experiment.
Required Reading.
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2014 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> 2014-07-11
</div>
</body>
</html>
